## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.DownloadFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/3a1b39b95c70eba5402ffb01c7b24b1f.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "cd439c1bdf3180bfe5f1acf3653e55f5-4" -> (known after apply)
      ~ id                     = "3a1b39b95c70eba5402ffb01c7b24b1f.zip" -> (known after apply)
      ~ key                    = "3a1b39b95c70eba5402ffb01c7b24b1f.zip" -> "1b68152f1c6b7f82ce1b22b21361cec3.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "LEUYzIS_AUXhOCVBhd9u8jmaZ6Ff2Yvk" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2025-03-14T15:12:01.253+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-DownloadFFISSpreadsheet:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-DownloadFFISSpreadsheet:1/invocations" -> (known after apply)
      ~ s3_key                         = "3a1b39b95c70eba5402ffb01c7b24b1f.zip" -> "1b68152f1c6b7f82ce1b22b21361cec3.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/42b4a3844d6f87f440398eb2afb719ed.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d08ba9557c7ba60f4035a14b6f50bc24-4" -> (known after apply)
      ~ id                     = "42b4a3844d6f87f440398eb2afb719ed.zip" -> (known after apply)
      ~ key                    = "42b4a3844d6f87f440398eb2afb719ed.zip" -> "6306ada9412b81b1b15ecf66180d67f6.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "null" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadGrantsGovDB"
      ~ last_modified                  = "2025-03-14T15:11:25.273+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-DownloadGrantsGovDB:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-DownloadGrantsGovDB:1/invocations" -> (known after apply)
      ~ s3_key                         = "42b4a3844d6f87f440398eb2afb719ed.zip" -> "6306ada9412b81b1b15ecf66180d67f6.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/fb8668fb281add42c88ce3e6a5661171.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "a534475d17bf97bd391012ab61c8cf6c-4" -> (known after apply)
      ~ id                     = "fb8668fb281add42c88ce3e6a5661171.zip" -> (known after apply)
      ~ key                    = "fb8668fb281add42c88ce3e6a5661171.zip" -> "f87093f91e583945a4729aaf847fe0de.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "99g4h2Zak588LTGMeMKxRtZEEwdcjUZ_" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-EnqueueFFISDownload"
      ~ last_modified                  = "2025-03-14T15:12:05.808+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-EnqueueFFISDownload:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-EnqueueFFISDownload:1/invocations" -> (known after apply)
      ~ s3_key                         = "fb8668fb281add42c88ce3e6a5661171.zip" -> "f87093f91e583945a4729aaf847fe0de.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/6a68ecfc09df27625de20d139a3ad1fa.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "24d11cf89e7d912b35653858873b40ec-4" -> (known after apply)
      ~ id                     = "6a68ecfc09df27625de20d139a3ad1fa.zip" -> (known after apply)
      ~ key                    = "6a68ecfc09df27625de20d139a3ad1fa.zip" -> "c9c895419c341d4f5a66282a222d828f.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "xHl6gygDjd2aFwsQmAkv1MOGjhufanfw" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2025-03-14T15:12:05.933+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-ExtractGrantsGovDBToXML:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-ExtractGrantsGovDBToXML:1/invocations" -> (known after apply)
      ~ s3_key                         = "6a68ecfc09df27625de20d139a3ad1fa.zip" -> "c9c895419c341d4f5a66282a222d828f.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/fee2a78afbcdc544227c128804c93927.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e348c81e28fbf37a5575813e116d33f8-4" -> (known after apply)
      ~ id                     = "fee2a78afbcdc544227c128804c93927.zip" -> (known after apply)
      ~ key                    = "fee2a78afbcdc544227c128804c93927.zip" -> "56df8e819225818737928dea3f5f2cbe.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "nwsuzheInMgjsxR9g2jIZJ7hJ.mdnIaN" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistFFISData"
      ~ last_modified                  = "2025-03-14T15:12:01.559+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PersistFFISData:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PersistFFISData:1/invocations" -> (known after apply)
      ~ s3_key                         = "fee2a78afbcdc544227c128804c93927.zip" -> "56df8e819225818737928dea3f5f2cbe.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/fe4373c5c0c1c759f79fdef0899438b2.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "3eaeb7839dfc91aed96ba0a51d36e4d6-4" -> (known after apply)
      ~ id                     = "fe4373c5c0c1c759f79fdef0899438b2.zip" -> (known after apply)
      ~ key                    = "fe4373c5c0c1c759f79fdef0899438b2.zip" -> "29ec6574eebafc21b646c9ff5eb28427.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "null" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2025-03-14T15:11:48.152+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PersistGrantsGovXMLDB:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PersistGrantsGovXMLDB:1/invocations" -> (known after apply)
      ~ s3_key                         = "fe4373c5c0c1c759f79fdef0899438b2.zip" -> "29ec6574eebafc21b646c9ff5eb28427.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/7761cce5e2010828128614ff8551a59a.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "67c5efe14caeb57a75e0a7c216adbd69-4" -> (known after apply)
      ~ id                     = "7761cce5e2010828128614ff8551a59a.zip" -> (known after apply)
      ~ key                    = "7761cce5e2010828128614ff8551a59a.zip" -> "524a55c6e4453e54aa3adfccafe34701.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "0fYQ4fZVQ_8adynQFYtL86snMjLkRbH2" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PublishGrantEvents"
      ~ last_modified                  = "2025-03-14T15:12:03.833+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PublishGrantEvents:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PublishGrantEvents:1/invocations" -> (known after apply)
      ~ s3_key                         = "7761cce5e2010828128614ff8551a59a.zip" -> "524a55c6e4453e54aa3adfccafe34701.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_permission.current_version_triggers["dynamodb"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "dynamodb" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/9de74353f141327595bb9d7090de8204.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d712ec47e3e589d7f9cc641e7beb9244-4" -> (known after apply)
      ~ id                     = "9de74353f141327595bb9d7090de8204.zip" -> (known after apply)
      ~ key                    = "9de74353f141327595bb9d7090de8204.zip" -> "fc60a2824b92e9d0b66e09204f870db9.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "XQDMxDfO.uSML_f1L2aDfDeautRGk.Lu" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ReceiveFFISEmail"
      ~ last_modified                  = "2025-03-14T15:12:09.741+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-ReceiveFFISEmail:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-ReceiveFFISEmail:1/invocations" -> (known after apply)
      ~ s3_key                         = "9de74353f141327595bb9d7090de8204.zip" -> "fc60a2824b92e9d0b66e09204f870db9.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/7bb5250d268d48985871069b0122bdfc.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "8adbc7816c3e1494bbfc8684a3034704-4" -> (known after apply)
      ~ id                     = "7bb5250d268d48985871069b0122bdfc.zip" -> (known after apply)
      ~ key                    = "7bb5250d268d48985871069b0122bdfc.zip" -> "368543ce4cb51c8f6889f303c3986b35.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "5rk11tjy7SIaBgvVgP3rKwmj7jc9AUyX" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitFFISSpreadsheet"
      ~ last_modified                  = "2025-03-14T15:12:11.139+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-SplitFFISSpreadsheet:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-SplitFFISSpreadsheet:1/invocations" -> (known after apply)
      ~ s3_key                         = "7bb5250d268d48985871069b0122bdfc.zip" -> "368543ce4cb51c8f6889f303c3986b35.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/b48aa86f45282c4ef1653afb7a726dc7.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "8362f33ad20aef6b0612b867c04b2293-4" -> (known after apply)
      ~ id                     = "b48aa86f45282c4ef1653afb7a726dc7.zip" -> (known after apply)
      ~ key                    = "b48aa86f45282c4ef1653afb7a726dc7.zip" -> "b34e11351e02708b8844527ed40d2f83.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "null" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2025-03-14T15:11:52.568+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-SplitGrantsGovXMLDB:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-SplitGrantsGovXMLDB:1/invocations" -> (known after apply)
      ~ s3_key                         = "b48aa86f45282c4ef1653afb7a726dc7.zip" -> "b34e11351e02708b8844527ed40d2f83.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "1" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 20 to add, 10 to change, 20 to destroy.
```

</details>

*Pusher: @dependabot[bot], Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/navapbc/grants-ingest/actions/runs/15484875586)*